index=main ("Failed password" OR "Accepted password")
| rex "from\s+(?<src_ip>\S+)"
| stats 
    count(eval(searchmatch("Failed password"))) AS failed_logins
    count(eval(searchmatch("Accepted password"))) AS successful_logins
  BY src_ip
| where failed_logins > 5 AND successful_logins >= 1
